/*****************************************************************************
	オーダー	: シリアルドライバ ヘッダファイル
	CPU			: H8 3069F
	コンパイラ	: h8300-elf-gcc version 3.4.6
	ファイル名	: serial.h
	接頭辞		: srl
	作成日時	: 2013-09-03
*****************************************************************************/
/*
	改訂履歴
*/

#ifndef _SERIAL_H_
#define _SERIAL_H_

/*****************************************************************************
	インクルード
*****************************************************************************/
#include	"defines.h"

/*****************************************************************************
	定義
*****************************************************************************/
#define	SERIAL_DEFAULT_DEV	(1)	/* デフォルトのシリアルデバイス番号 */

#define	SERIAL_DEV00		(0)
#define	SERIAL_DEV01		(1)
#define	SERIAL_DEV02		(2)

/*****************************************************************************
	型定義、構造体定義
*****************************************************************************/

/*****************************************************************************
	プロトタイプ宣言
*****************************************************************************/
int			srlInit(int iIdx);						/* シリアルデバイス初期化 */
KOS_BOOL	srlIsSendEnable(int iIdx);				/* シリアル送信可能判定 */
KOS_BOOL	srlIsRecvEnable(int iIdx);				/* シリアル受信可能判定 */
int			srlSendByte(int iIdx, uint08 ucBuf);	/* シリアル1Byte送信 */
uint08		srlRecvByte(int iIdx);					/* シリアル1Byte受信 */

KOS_BOOL	srlIntrIsSendEnable(int iIdx);		/* 送信割込可否チェック */
void		srlIntrSetSendEnable(int iIdx);		/* 送信割込可能設定 */
void		srlIntrSetSendDisable(int iIdx);	/* 送信割込不可設定 */
KOS_BOOL	srlIntrIsRecvEnable(int iIdx);		/* 受信割込可否チェック */
void		srlIntrSetRecvEnable(int iIdx);		/* 受信割込可能設定 */
void		srlIntrSetRecvDisable(int iIdx);	/* 受信割込不可設定 */

/*****************************************************************************
	外部変数 
*****************************************************************************/


#endif /* _SERIAL_H_ */

/***** End Of File *****/


