/*****************************************************************************
	オーダー	: KOZOS本体 ヘッダ
	CPU			: H8 3069F
	コンパイラ	: h8300-elf-gcc version 3.4.6
	ファイル名	: kozos.h
	接頭辞		: kz
	作成日時	: 2014-06-04
*****************************************************************************/
/*
	改訂履歴
*/

#ifndef _KOZOS_H_
#define _KOZOS_H_

/*****************************************************************************
	インクルード
*****************************************************************************/
#include	"defines.h"
#include	"interrupt.h"
#include	"syscall.h"

/*****************************************************************************
	定義
*****************************************************************************/

/*****************************************************************************
	型定義、構造体定義
*****************************************************************************/

/*****************************************************************************
	プロトタイプ宣言
*****************************************************************************/
/* システム・コール */
/* ライブラリ関数 */
/*
	初期スレッドを生成。
	OSというプログラムをスタートさせるために使用する。
	一番最初に本関数を呼び出し、それ以降はkzRunで
	スレッドを開始する。
*/
void kzStart(
	KZ_FUNC_T*	pFunc,
	char*		pcName,
	int			iPriority,
	int			iStackSize,
	int			argc,
	char**		argv
);
void kzSysdown(void);
void kzSyscall(KZ_SYSCALL_TYPE_T type, KZ_SYSPARAM_T* pParam);
void kzSrvcall(KZ_SYSCALL_TYPE_T type, KZ_SYSPARAM_T* pParam);

/* システムタスク */
int consdrv_main(int argc, char** argv);
/* ユーザタスク */
int command_main(int argc, char** argv);

/*****************************************************************************
	外部変数 
*****************************************************************************/
extern	char**	ppcOsEntryFp;

#endif /* _KOZOS_H_ */


/***** End Of File *****/


