/*****************************************************************************
	オーダー	: 割り込みベクタ
	CPU			: H8 3069F
	コンパイラ	: h8300-elf-gcc version 3.4.6
	ファイル名	: vector.c
	接頭辞		: intr
	作成日時	: 2013-09-03
*****************************************************************************/
/*
	改訂履歴
*/

/*****************************************************************************
	インクルード
*****************************************************************************/
#include	"defines.h"

/*****************************************************************************
	定義
*****************************************************************************/

/*****************************************************************************
	型定義、構造体定義
*****************************************************************************/

/*****************************************************************************
	外部変数
*****************************************************************************/

/*****************************************************************************
	内部変数
*****************************************************************************/

/*****************************************************************************
	プロトタイプ宣言
*****************************************************************************/
extern void start(void);
extern void intrSofterr(void);
extern void intrSyscall(void);
extern void intrSerial(void);

/*	割り込みベクタの設定									*/
/*	リンカ・スクリプトの定義により、先頭番地に配置される	*/
/*	関数ポインタの配列										*/
void	(*vectors[])(void) = {
	start,	NULL,	NULL,	NULL,
	NULL,	NULL,	NULL,	NULL,
	intrSyscall, intrSofterr, intrSofterr, intrSofterr,
	NULL,	NULL,	NULL,	NULL,
	NULL,	NULL,	NULL,	NULL,
	NULL,	NULL,	NULL,	NULL,
	NULL,	NULL,	NULL,	NULL,
	NULL,	NULL,	NULL,	NULL,
	NULL,	NULL,	NULL,	NULL,
	NULL,	NULL,	NULL,	NULL,
	NULL,	NULL,	NULL,	NULL,
	NULL,	NULL,	NULL,	NULL,
	NULL,	NULL,	NULL,	NULL,
	intrSerial,	intrSerial,	intrSerial,	intrSerial,
	intrSerial,	intrSerial,	intrSerial,	intrSerial,
	intrSerial,	intrSerial,	intrSerial,	intrSerial,
};


/***** End Of File *****/


